# Join Statements - Lab

## Introduction

In this lab, you'll practice your knowledge of `JOIN` statements, using various types of joins and various methods for specifying the links between them.

## Objectives

You will be able to:
* Write SQL queries that make use of various types of joins
* Compare and contrast the various types of joins
* Discuss how primary and foreign keys are used in SQL
* Decide and perform whichever type of join is best for retrieving desired data

## CRM Schema

In almost all cases, rather than just working with a single table you will typically need data from multiple tables. 
Doing this requires the use of **joins** using shared columns from the two tables. 

In this lab, you'll use the same customer relationship management (CRM) database that you saw from the previous lesson.
<img src='images/Database-Schema.png' width="600">

## Connecting to the Database
Import the necessary packages and connect to the database `'data.sqlite'`.

In [2]:
# Your code here
import pandas as pd
import sqlite3
conn = sqlite3.connect('data.sqlite')
cur = conn.cursor()

## Display the names of all the employees in Boston 

Hint: join the employees and offices tables.

In [3]:
# Your code here
cur.execute("""SELECT firstName, lastName 
               FROM employees 
               JOIN offices 
               USING(officeCode)
               WHERE city == 'Boston'""")

df = pd.DataFrame(cur.fetchall()) 
df.columns = [i[0] for i in cur.description]
df.head()

  firstName   lastName
0     Julie   Firrelli
1     Steve  Patterson

## Are there any offices that have zero employees?
Hint: Combine the employees and offices tables and use a group by.

In [4]:
# Your code here
cur.execute("""SELECT o.officeCode, o.city, COUNT(e.employeeNumber) AS n_employees
               FROM offices AS o
               LEFT JOIN employees AS e
               USING(officeCode)
               GROUP BY officeCode
               HAVING n_employees = 0""")

df = pd.DataFrame(cur.fetchall()) 
df.columns = [i[0] for i in cur.description]
df.head()

   officeCode    city  n_employees
0          27  Boston            0

## Write 3 Questions of your own and answer them

In [5]:
# Answers will vary
# Example: Display the htmlDescription and employee's first and last name for each product that each employee has sold

In [6]:
# Display the htmlDescription and employee's first and last name for each product that each employee has sold
cur.execute("""SELECT htmlDescription, firstName, lastName 
               FROM productlines JOIN employees
               """)

df = pd.DataFrame(cur.fetchall()) 
df.columns = [i[0] for i in cur.description]
df.head()

  htmlDescription firstName   lastName
0                     Diane     Murphy
1                      Mary  Patterson
2                      Jeff   Firrelli
3                   William  Patterson
4                    Gerard     Bondur

In [ ]:
# What office has the most employees?

In [ ]:
# What

## Level Up: Display the names of every individual product that each employee has sold

In [16]:

cur.execute("""SELECT DISTINCT productName, firstName, lastName
               FROM employees e
               JOIN customers c
               ON e.employeeNumber = c.salesRepEmployeeNumber
               JOIN orders 
               USING(customerNumber)
               JOIN orderdetails
               USING(orderNumber)
               JOIN products 
               USING(productCode)
               ORDER BY firstName, lastName, productName""")


df = pd.DataFrame(cur.fetchall()) 
df.columns = [i[0] for i in cur.description]
df

                              productName firstName   lastName
0     18th Century Vintage Horse Carriage      Andy     Fixter
1                  1900s Vintage Bi-Plane      Andy     Fixter
2                 1900s Vintage Tri-Plane      Andy     Fixter
3                      1911 Ford Town Car      Andy     Fixter
4             1913 Ford Model T Speedster      Andy     Fixter
...                                   ...       ...        ...
1363                        The Mayflower     Steve  Patterson
1364                       The Queen Mary     Steve  Patterson
1365                The Schooner Bluenose     Steve  Patterson
1366                          The Titanic     Steve  Patterson
1367            The USS Constitution Ship     Steve  Patterson

[1368 rows x 3 columns]

## Level Up: Display the Number of Products each employee has sold

In [24]:
# Your code here

# cur.execute("""SELECT firstName, lastName, SUM(quantityOrdered)
#                FROM employees e
#                JOIN customers c
#                ON e.employeeNumber = c.salesRepEmployeeNumber
#                JOIN orders
#                USING (customerNumber)
#                JOIN orderdetails
#                USING (orderNumber)
#                GROUP BY firstName, lastName
#                """)

cur.execute("""SELECT COUNT (DISTINCT productCode),firstName, lastName
               FROM employees e
               JOIN customers c
               ON e.employeeNumber = c.salesRepEmployeeNumber
               JOIN orders
               USING (customerNumber)
               JOIN orderdetails
               USING (orderNumber)
               JOIN products 
               USING (productCode)
               GROUP BY firstName, lastName
               """)

df = pd.DataFrame(cur.fetchall()) 
df.columns = [i[0] for i in cur.description]
df.head(20)

    COUNT (DISTINCT productCode) firstName   lastName
0                             82      Andy     Fixter
1                             98     Barry      Jones
2                             74  Foon Yue      Tseng
3                             96    George     Vanauf
4                            109    Gerard  Hernandez
5                             80     Julie   Firrelli
6                             97     Larry       Bott
7                            107    Leslie   Jennings
8                             73    Leslie   Thompson
9                            101      Loui     Bondur
10                            81      Mami      Nishi
11                            78    Martin     Gerard
12                           100    Pamela   Castillo
13                            97     Peter      Marsh
14                            95     Steve  Patterson

## Summary

Congrats! You practiced using join statements and leveraged your foreign keys knowledge!